using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace fairdao.extensions.shared.entity
{
    /// <summary>
    /// 状态码
    /// </summary>
    public enum StateCode
    {
        操作成功 = 0,
        参数错误 = 1,
        Token验证失败 = 2,
        Command未找到 = 3,
        非法操作 = 4,
        日期格式错误 = 10,
        数据格式错误 = 11,
        没有权限 = 97,
        操作失败 = 98,
        未知错误 = 99,
        账号被锁定 = 100,
        账号格式错误 = 101,
        账号不存在 = 102,
        此账号被占用 = 103,
        密码格式错误 = 104,
        密码错误 = 105,
        新旧密码相同 = 106,
        会员账号不可用 = 107,
        登入失败 = 108,
        注册失败 = 109,
        此账号已登入 = 110,
        此账号已登出 = 111,
        此账号未登入 = 112,
        传入的代理账号不是代理 = 113,
        找不到会员 = 114,
        账号已占用 = 116,
        找不到会员所属的分公司 = 117,
        找不到指定的代理 = 118,
        余额不足 = 120,
        免费试玩账号用完 = 150,
        系统维护 = 300,
        APIKey错误 = 320,
        找不到相应的限红组 = 321,
        找不到指定的货币类型 = 322,
        转账流水号占用 = 323,
        转账失败 = 324,
        代理状态不可用 = 325,
        会员代理没有视频组 = 326,
        客户端IP受限 = 400,
        网络已断开 = 401,
        连接关闭 = 402,
        客户端来源受限 = 403,
        请求的资源不存在 = 404,
        请求太频繁 = 405,
        请求超时 = 406,
        找不到游戏地址 = 407,
        空指针异常 = 500,
        系统异常 = 501,
        系统忙 = 502,
        数据操作异常 = 503,
        黑客入侵=10000,
        层数限制已无法开户=1001,
        手机格式不正确=1002,
        手机号已被注册 = 1003,
        功能未开启 = 10004,
        功能已开启 = 10005,
        功能被禁用=10006,
        未发现数据 = 10007,
        资源不存在= 10008,
        资源已存在 = 10009,
        数据不能为空=100011,
        插件未加载=100012,
        订单有误=100013
        
    }
}
